# coding=utf-8
from __future__ import unicode_literals
from .. import Provider as BaseProvider


class Provider(BaseProvider):
    jobs = [
        'Автоелектричар', 'Автолакер', 'Автомобилски техничар',
        'Агент за недвижнини', 'Архивар', 'Библиотекар', 'Бравар',
        'Водоводџија', 'Воспитувач', 'Геолог', 'Геолошки техничар',
        'Дефектолог', 'Дипломиран физиотерапевт', 'Диригент', 'Економист',
        'Електричар', 'Забен техничар', 'Земјоделски техничар', 'Ѕидар',
        'Инспектор', 'Инспектор за животна средина', 'Инструктор за возење',
        'Информатичар', 'Каменорезац', 'Козметичар', 'Конзерватор',
        'Консултатн', 'Криминолог', 'Машински инженер', 'Медицинска сестра',
        'Mедицински техничар', 'Месар', 'Механичар', 'Млекар', 'Молер',
        'Наставник', 'Оџачар', 'Педијатар', 'Програмер', 'Радиолог',
        'Ревматолог', 'Рударски инженер', 'Сметководител', 'Столар',
        'Стоматолог', 'Стоматолог специјалист', 'Фармацевт', 'Физиотарапевт',
        'Фотограф', 'Фризер', 'Хемичар', 'Хирург', 'Чувар'
    ]
