# coding=utf-8
from __future__ import unicode_literals
from .. import Provider as PersonProvider


class Provider(PersonProvider):
    first_names_female = (
        'Александра', 'Ана', 'Анастасија', 'Ангела', 'Ангелина', 'Анѓа',
        'Атанасија', 'Билјана', 'Бисера', 'Бистра', 'Блага', 'Благица',
        'Благородна', 'Благуна', 'Блаженка', 'Богдана', 'Божана', 'Бојана',
        'Борјана', 'Борка', 'Босилка', 'Бранка', 'Валентина', 'Варвара',
        'Василка', 'Велика', 'Велјана', 'Вера', 'Вероника', 'Весела', 'Весна',
        'Виолета', 'Војданка', 'Воскресија', 'Галена', 'Голубинка', 'Гордана',
        'Горица', 'Горјана', 'Грозда', 'Дамјана', 'Даница', 'Даринка',
        'Дафина', 'Деница', 'Деспина', 'Дивна', 'Добринка', 'Домника', 'Донка',
        'Драгана', 'Душанка', 'Ѓурѓа', 'Ѓурѓица', 'Ева', 'Евгенија', 'Евросина',
        'Екатерина', 'Елисавета', 'Ефимија', 'Елица', 'Елеонора', 'Евдокија',
        'Живка', 'Загорка', 'Зафирка', 'Захринка', 'Здравка', 'Злата', 'Зора',
        'Зорица', 'Зорка', 'Ѕвезда', 'Ивана', 'Иванка', 'Илинка', 'Илинденка',
        'Ирина', 'Искра', 'Јаворка', 'Јагода', 'Јана', 'Јасна', 'Јована',
        'Јовка', 'Јордана', 'Јорданка', 'Калина', 'Каранфилка', 'Ката',
        'Катерина', 'Катина', 'Кита', 'Климентина', 'Константина', 'Косара',
        'Костадинка', 'Крстана', 'Лена', 'Лидија', 'Лина', 'Лилјана', 'Љуба',
        'Љубинка', 'Љубица', 'Љупка', 'Магдалена', 'Македонка', 'Макрина',
        'Марија', 'Марика', 'Марина', 'Марта', 'Матрона', 'Меглена', 'Меланија',
        'Милева', 'Милена', 'Мирка', 'Милица', 'Милка', 'Мирјана', 'Нада',
        'Надежда', 'Наумка', 'Невенка', 'Неда', 'Неделка', 'Никодина',
        'Николина', 'Олга', 'Оливера', 'Павлинка', 'Параскева', 'Пауна',
        'Перса', 'Пелагија', 'Петкана', 'Петра', 'Петранка', 'Писана', 'Рајна',
        'Ракита', 'Рафаила', 'Рахела', 'Рахилка', 'Ристана', 'Родна', 'Роса',
        'Роска', 'Ружа', 'Румена', 'Русалина', 'Русанка', 'Сава', 'Сандра',
        'Сара', 'Сашка', 'Светлана', 'Серафима', 'Симјанка', 'Симона',
        'Славенка', 'Славица', 'Славка', 'Слободанка', 'Снежана', 'Сончица',
        'Софија', 'Спасена', 'Споменка', 'Сребра', 'Стамена', 'Стојанка',
        'Стојмена', 'Стефанија', 'Стефанка', 'Сузана', 'Спаса', 'Татјана',
        'Тамара', 'Темјана', 'Теодора', 'Теодосија', 'Теофилка', 'Тодорка',
        'Трајанка', 'Трена', 'Трендафилка', 'Убавка', 'Филимена', 'Флоринка',
        'Фросина', 'Цвета', 'Цара', 'Христина'
    )

    last_names_female = (
        'Ангеловска', 'Божиновска', 'Георгиевска', 'Христова', 'Илиевска',
        'Иванова', 'Ивановска', 'Јаневска', 'Јанкуловска', 'Јовановска',
        'Китановска', 'Кочева', 'Кузманова', 'Крстевска', 'Лазаревска',
        'Лазарова', 'Марковска', 'Михајловска', 'Митреска', 'Милевска',
        'Митева', 'Наумова', 'Николова', 'Николовска', 'Панчева', 'Петковска',
        'Петровска', 'Ристовска', 'Русевска', 'Симоновска', 'Србиновска',
        'Стефанова', 'Стефановска', 'Стојанова', 'Тодоровска', 'Трајковска',
        'Ванева', 'Вељановска'
    )

    first_names_male = (
        'Аврам', 'Александар', 'Алимпиј', 'Атанас', 'Ангел', 'Андон', 'Андреј',
        'Антим', 'Антониј', 'Апостол', 'Аритон', 'Арсениј', 'Атанасиј',
        'Благој', 'Благојa', 'Богатин', 'Богдан', 'Богослав', 'Божин', 'Бојан',
        'Борис', 'Борјан', 'Бранко', 'Василиј', 'Велјан', 'Венко', 'Веселин',
        'Виктор', 'Владимир', 'Војдан', 'Војкан', 'Гаврил', 'Георгиј',
        'Герасим', 'Глигор', 'Глигориј', 'Горан', 'Горјан', 'Гоце', 'Григор',
        'Григориј', 'Гроздан', 'Давид', 'Дамјан', 'Данаил', 'Дејан', 'Делјан',
        'Делчо', 'Димитар', 'Димитриј', 'Дојчин', 'Драган', 'Душко', 'Ѓоко',
        'Горѓија', 'Ѓорче', 'Ѓурчин', 'Евгениј', 'Евтим', 'Елисиј', 'Еразмо',
        'Емануел', 'Емил', 'Ефтим', 'Живко', 'Зафир', 'Захариј', 'Здравко',
        'Златан', 'Златко', 'Зоран', 'Ѕвездан', 'Ѕвонко', 'Иван', 'Игнат',
        'Игнатиј', 'Игор', 'Илија', 'Иринеј', 'Исак', 'Јаков', 'Јане', 'Јоаким',
        'Јован', 'Јордан', 'Јосиф', 'Кирил', 'Климент', 'Козма', 'Константин',
        'Костадин', 'Крсте', 'Кузман', 'Кочо', 'Лазар', 'Лазар', 'Леонид',
        'Лука', 'Љубен', 'Љубомир', 'Љупчо', 'Македон', 'Мануел', 'Марин',
        'Марјан', 'Марко', 'Методиј', 'Мирко', 'Митре', 'Михаил', 'Наум',
        'Неделко', 'Неофит', 'Нестор', 'Никита', 'Никифор', 'Никодим', 'Никола',
        'Огнен', 'Оливер', 'Павле', 'Пантелејмон', 'Панче', 'Партениј', 'Петар',
        'Петко', 'Пимен', 'Прокопиј', 'Размо', 'Рајко', 'Ристе', 'Ромил',
        'Самуил', 'Силјан', 'Симон', 'Славе', 'Софрониј', 'Сотир', 'Спасе',
        'Сребре', 'Стефан', 'Стојан', 'Темелко', 'Теодор', 'Теодсиј', 'Теофан',
        'Теофил', 'Тихомир', 'Трајан', 'Тодор', 'Трифун', 'Филип', 'Христијан',
        'Христо', 'Цветан', 'Часлав', 'Чедомир')

    last_names_male = (
        'Ангеловски', 'Бабунски', 'Божиновски', 'Георгиевски', 'Христов',
        'Илич', 'Илиевски', 'Иванов', 'Ивановски', 'Јаневски', 'Јанкуловски',
        'Јовановски', 'Китановски', 'Кочев', 'Кузманов', 'Крстевски',
        'Лазаревски', 'Лазаров', 'Марковски', 'Михајловски', 'Митрески',
        'Милевски', 'Митев', 'Наумов', 'Николов', 'Николовски', 'Панчев',
        'Пандев', 'Петковски', 'Петровски', 'Ристовски', 'Русевски',
        'Симоновски', 'Србиновски', 'Стефанов', 'Стефановски', 'Стојанов',
        'Тодоровски', 'Трајковски', 'Ванев', 'Вељановски')

    prefixes_female = ('Г-ѓа', 'Г-ца', 'Д-р.', 'М-p')
    prefixes_male = ('Г-н', 'Д-р.', 'М-p')

    formats_female = (
        '{{first_name_female}} {{last_name_female}}',
        '{{prefix_female}} {{first_name_female}} {{last_name_female}}'
    )

    formats_male = (
        '{{first_name_male}} {{last_name_male}}',
        '{{prefix_male}} {{first_name_male}} {{last_name_male}}'
    )

    formats = formats_male + formats_female
    first_names = first_names_male + last_names_male
    last_names = first_names_female + last_names_female
